<a href="https://colab.research.google.com/github/mohd-faizy/Lib_Pandas/blob/master/03_Pandas_PART_1_4(G4G).ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# __$Pandas$ $G4G$__ __$Part$__ : $1-5$

### $Index$


1.  $Introduction$ $\checkmark$ 
2.  $Creating Objects$ $\checkmark$
3.  $Viewing Data$ $\checkmark$
4.  $Selection$ $\checkmark$
5.  Manipulating Data
6.  Grouping Data
7.  Merging, Joining and Concatenating
8.  Working with Date and Time
9.  Working With Text Data
10. Working with CSV and Excel files
11. Operations
12. Visualization
13. Applications and Projects
14. Miscellaneous

__How to install Pandas?__
```
pip install pandas
```

> $Pandas$  is an __open-source__ library that is built on top of $NumPy$ library.

* It is a _Python package_ that offers various _data structures_ and operations for __manipulating numerical data__ and __time series__.

* It is mainly popular for importing and analyzing data much easier. Pandas is fast and it has high-performance & productivity for users.

In [ ]:
 from google.colab import files
upload_file = files.upload()

Saving nba.csv to nba.csv

## __1. Introduction to Pandas in Python__

__Table of Content__

- History
- Advantages
- Getting Started
  - _Series_
  - _DataFrame_
- Why Pandas is used for __Data Science__

> $\rightarrow$ Pandas was initially developed by Wes $McKinney$ in 2008.

__Advantages__

- __Fast__ and __efficient__ for __manipulating__ and __analyzing data.__
- Easy handling of __missing data__ (represented as NaN) in floating point as well as non-floating point data
- __Size mutability:__ columns can be inserted and deleted from DataFrame and higher dimensional objects
- Data set __Merging__ and __Joining.__
- Flexible __Reshaping__ and __Pivoting__ of data sets
- Provides __time-series__ functionality.
- Powerful `groupby` functionality for performing split-apply-combine operations on data sets.

Pandas generally provide two __data structure__ for manipulating data, They are:

1.    Series
2.    DataFrame

### $1-Series$

> Pandas Series is a one-dimensional labeled 

![Series](https://media.geeksforgeeks.org/wp-content/uploads/20200225170506/pandas-series.png)

In [ ]:
import pandas as pd 
import numpy as np 


# Creating empty series 
ser = pd.Series() 
	
print(ser) 

# simple array 
data = np.array(['g', 'e', 'e', 'k', 's']) 
	
ser = pd.Series(data) 
print(ser)

Series([], dtype: float64)
0    g
1    e
2    e
3    k
4    s
dtype: object

/usr/local/lib/python3.6/dist-packages/ipykernel_launcher.py:6: DeprecationWarning: The default dtype for empty Series will be 'object' instead of 'float64' in a future version. Specify a dtype explicitly to silence this warning.

### $2- DataFrame$

> Pandas DataFrame is __two-dimensional__ size-mutable, potentially heterogeneous tabular data structure with labeled axes (rows and columns).

![DataFrame](https://media.geeksforgeeks.org/wp-content/uploads/20200225170602/pandas-dataframe.png)

In [ ]:
import pandas as pd 
	
# Calling DataFrame constructor 
df = pd.DataFrame() 
print(df) 

# list of strings 
lst = ['Geeks', 'For', 'Geeks', 'is', 
			'portal', 'for', 'Geeks'] 
	
# Calling DataFrame constructor on list 
df = pd.DataFrame(lst) 
print(df)

Empty DataFrame
Columns: []
Index: []
        0
0   Geeks
1     For
2   Geeks
3      is
4  portal
5     for
6   Geeks

__Why Pandas is used for Data Science?__

$Pandas$ is used in conjunction with other libraries that are used for data science. It is built _on the top_ of the $NumPy$ library which means that a lot of structures of NumPy are used or replicated in Pandas.

The data produced by Pandas is often used as input for __plotting__ functions of $Matplotlib$, __statistical__ analysis in $SciPy$, machine learning algorithm in $Scikit-learn$.
**bold text**

## __2. Creating Objects__

### __a. Python | Pandas__  $DataFrame$

1. _Creating a DataFrame_
2. _Dealing with Rows and Columns_
3. _Indexing and Selecting Data_
4. _Working with Missing Data_
5. _Iterating over rows and columns_

In [ ]:
# import pandas as pd 
import pandas as pd 
  
# Calling DataFrame constructor 
df = pd.DataFrame() 
  
print(df)

Empty DataFrame
Columns: []
Index: []

#### __1. Creating a dataframe using List:__

In [ ]:
# import pandas as pd
import pandas as pd
 
# list of strings
lst = ['Geeks', 'For', 'Geeks', 'is', 
            'portal', 'for', 'Geeks']
 
# Calling DataFrame constructor on list
df = pd.DataFrame(lst)
df

        0
0   Geeks
1     For
2   Geeks
3      is
4  portal
5     for
6   Geeks

$\rightarrow$ Creating DataFrame from dict of ndarray/lists:

In [ ]:
# Python code demonstrate creating 
# DataFrame from dict narray / lists 
# By default addresses.
 
import pandas as pd
 
# intialise data of lists.
data = {'Name':['Tom', 'nick', 'krish', 'jack'],
        'Age':[20, 21, 19, 18]}
 
# Create DataFrame
df = pd.DataFrame(data)
 
# Print the output.
df

    Name  Age
0    Tom   20
1   nick   21
2  krish   19
3   jack   18

#### __2. Dealing with Rows and Columns:__

a) Column Selection:

In [ ]:
# Import pandas package
import pandas as pd
 
# Define a dictionary containing employee data
data = {'Name':['Jai', 'Princi', 'Gaurav', 'Anuj'],
        'Age':[27, 24, 22, 32],
        'Address':['Delhi', 'Kanpur', 'Allahabad', 'Kannauj'],
        'Qualification':['Msc', 'MA', 'MCA', 'Phd']}
 
# Convert the dictionary into DataFrame 
df = pd.DataFrame(data)
 
# select two columns
df[['Name', 'Qualification']]

     Name Qualification
0     Jai           Msc
1  Princi            MA
2  Gaurav           MCA
3    Anuj           Phd

b) Row Selection:

In [ ]:
# importing pandas package
import pandas as pd
 
# making data frame from csv file
data = pd.read_csv("/content/nba.csv", index_col ="Name")
 
# retrieving row by loc method
first = data.loc["Avery Bradley"]
second = data.loc["R.J. Hunter"]
 
 
print(first, "\n\n\n", second)

Team        Boston Celtics
Number                   0
Position                PG
Age                     25
Height                 6-2
Weight                 180
College              Texas
Salary         7.73034e+06
Name: Avery Bradley, dtype: object


 Team        Boston Celtics
Number                  28
Position                SG
Age                     22
Height                 6-5
Weight                 185
College      Georgia State
Salary         1.14864e+06
Name: R.J. Hunter, dtype: object

#### __3. Indexing and Selecting Data__

In [ ]:
# importing pandas package
import pandas as pd
 
# making data frame from csv file
data = pd.read_csv("/content/nba.csv", index_col ="Name")
 
# retrieving columns by indexing operator
first = data["Age"]
first

Name
Avery Bradley    25.0
Jae Crowder      25.0
John Holland     27.0
R.J. Hunter      22.0
Jonas Jerebko    29.0
                 ...
Shelvin Mack     26.0
Raul Neto        24.0
Tibor Pleiss     26.0
Jeff Withey      26.0
NaN               NaN
Name: Age, Length: 458, dtype: float64

In [ ]:
data.head(-5) #Compleat DataFrame

                          Team  Number  ...            College      Salary
Name                                    ...
Avery Bradley   Boston Celtics     0.0  ...              Texas   7730337.0
Jae Crowder     Boston Celtics    99.0  ...          Marquette   6796117.0
John Holland    Boston Celtics    30.0  ...  Boston University         NaN
R.J. Hunter     Boston Celtics    28.0  ...      Georgia State   1148640.0
Jonas Jerebko   Boston Celtics     8.0  ...                NaN   5000000.0
...                        ...     ...  ...                ...         ...
Gordon Hayward       Utah Jazz    20.0  ...             Butler  15409570.0
Rodney Hood          Utah Jazz     5.0  ...               Duke   1348440.0
Joe Ingles           Utah Jazz     2.0  ...                NaN   2050000.0
Chris Johnson        Utah Jazz    23.0  ...             Dayton    981348.0
Trey Lyles           Utah Jazz    41.0  ...           Kentucky   2239800.0

[453 rows x 8 columns]

Indexing a DataFrame using __`.loc[ ]` :__

In [ ]:
# importing pandas package
import pandas as pd
 
# making data frame from csv file
data = pd.read_csv("/content/nba.csv", index_col ="Name")
 
# retrieving row by loc method
first = data.loc["Avery Bradley"]
second = data.loc["R.J. Hunter"]
 
 
print(first, "\n\n\n", second)

Team        Boston Celtics
Number                   0
Position                PG
Age                     25
Height                 6-2
Weight                 180
College              Texas
Salary         7.73034e+06
Name: Avery Bradley, dtype: object


 Team        Boston Celtics
Number                  28
Position                SG
Age                     22
Height                 6-5
Weight                 185
College      Georgia State
Salary         1.14864e+06
Name: R.J. Hunter, dtype: object

Indexing a DataFrame using __`.iloc[ ]`:__

In [ ]:
import pandas as pd
 
# making data frame from csv file
data = pd.read_csv("/content/nba.csv", index_col ="Name")
 
 
# retrieving rows by iloc method 
row2 = data.iloc[3] 
print(row2)

Team        Boston Celtics
Number                  28
Position                SG
Age                     22
Height                 6-5
Weight                 185
College      Georgia State
Salary         1.14864e+06
Name: R.J. Hunter, dtype: object

#### __4. Working with Missing Data__

Checking for __missing values__ using:

-  `isnull()` 
-  `notnull()`

In [ ]:
# importing pandas as pd
import pandas as pd
 
# importing numpy as np
import numpy as np
 
# dictionary of lists
dict = {'First Score':[100, 90, np.nan, 95],
        'Second Score': [30, 45, 56, np.nan],
        'Third Score':[np.nan, 40, 80, 98]}
 
# creating a dataframe from list
df = pd.DataFrame(dict)
 
# using isnull() function  
df.isnull()

   First Score  Second Score  Third Score
0        False         False         True
1        False         False        False
2         True         False        False
3        False          True        False

Filling __Missing values__ using:

- `fillna()`
- `replace()`  
- `interpolate()`

In [ ]:
# importing pandas as pd
import pandas as pd
 
# importing numpy as np
import numpy as np
 
# dictionary of lists
dict = {'First Score':[100, 90, np.nan, 95],
        'Second Score': [30, 45, 56, np.nan],
        'Third Score':[np.nan, 40, 80, 98]}
 
# creating a dataframe from dictionary
df = pd.DataFrame(dict)
 
# filling missing value using fillna()  
df.fillna(0)

   First Score  Second Score  Third Score
0        100.0          30.0          0.0
1         90.0          45.0         40.0
2          0.0          56.0         80.0
3         95.0           0.0         98.0

__Dropping__ missing values using `dropna()`:

In [ ]:
# importing pandas as pd
import pandas as pd
 
# importing numpy as np
import numpy as np
 
# dictionary of lists
dict = {'First Score':[100, 90, np.nan, 95],
        'Second Score': [30, np.nan, 45, 56],
        'Third Score':[52, 40, 80, 98],
        'Fourth Score':[np.nan, np.nan, np.nan, 65]}
 
# creating a dataframe from dictionary
df = pd.DataFrame(dict)
df

   First Score  Second Score  Third Score  Fourth Score
0        100.0          30.0           52           NaN
1         90.0           NaN           40           NaN
2          NaN          45.0           80           NaN
3         95.0          56.0           98          65.0

In [ ]:
 # using dropna() function  
df.dropna()

   First Score  Second Score  Third Score  Fourth Score
3         95.0          56.0           98          65.0

#### __5. Iterating over rows and columns__

Iterating over $Rows$ :

- `iteritems()`
- `iterrows()`
- `itertuples()`

In [ ]:
# importing pandas as pd
import pandas as pd
  
# dictionary of lists
dict = {'name':["aparna", "pankaj", "sudhir", "Geeku"],
        'degree': ["MBA", "BCA", "M.Tech", "MBA"],
        'score':[90, 40, 80, 98]}
 
# creating a dataframe from a dictionary 
df = pd.DataFrame(dict)
 
print(df)

     name  degree  score
0  aparna     MBA     90
1  pankaj     BCA     40
2  sudhir  M.Tech     80
3   Geeku     MBA     98

Now we apply `iterrows()` function in order to get a each element of rows.

In [ ]:
# iterating over rows using iterrows() function 
for i, j in df.iterrows():
    print(i, j)
    print()

0 name      aparna
degree       MBA
score         90
Name: 0, dtype: object

1 name      pankaj
degree       BCA
score         40
Name: 1, dtype: object

2 name      sudhir
degree    M.Tech
score         80
Name: 2, dtype: object

3 name      Geeku
degree      MBA
score        98
Name: 3, dtype: object

Iterating over $Columns$:

In [ ]:
# creating a list of dataframe columns
columns = list(df)
 
for i in columns:
 
    # printing the third element of the column
    print (df[i][2])

sudhir
M.Tech
80

![Pandas_1](https://scontent.fdel32-1.fna.fbcdn.net/v/t1.0-9/117396750_2992912804268928_3776915844389120553_o.jpg?_nc_cat=101&_nc_sid=0debeb&_nc_ohc=O2lDakyITtUAX9kBZeG&_nc_ht=scontent.fdel32-1.fna&oh=075df1506ddfd32aa78e5b61832d564c&oe=5F5535D8)

### __b. Python | Pandas__ $Series$

1. _Creating a Series_
2. _Accessing element of Series_
3. _Indexing and Selecting Data in Series_
4. _Binary operation on Series_
5. _Conversion Operation on Series_

- In the real world, a Pandas Series will be created by loading the datasets from existing storage, storage can be SQL Database, CSV file, and Excel file.

- Pandas Series can be created from the lists, dictionary, and from a scalar value etc.

- Series can be created in different ways, here are some ways by which we create a series:

#### __1. Creating a series:__

__From array__

In [ ]:
# import pandas as pd
import pandas as pd
 
# import numpy as np
import numpy as np
 
# simple array
data = np.array(['F', 'A', 'I', 'Z', 'Y'])
 
ser = pd.Series(data)
print(ser)

0    F
1    A
2    I
3    Z
4    Y
dtype: object

__From Lists:__

In [ ]:
import pandas as pd
 
# a simple list
list = ['F', 'A', 'I', 'Z', 'Y']
  
# create series form a list
ser = pd.Series(list)
print(ser)

0    F
1    A
2    I
3    Z
4    Y
dtype: object

#### __2. Accessing element of Series__

__with Position:__

In [ ]:
# import pandas and numpy 
import pandas as pd
import numpy as np
 
# creating simple array
data = np.array(['M', 'O', 'H', 'D', 'F', 'A', 'I', 'Z', 'Y'])
ser = pd.Series(data)
  
  
#retrieve the first element
print(ser[-5:])

4    F
5    A
6    I
7    Z
8    Y
dtype: object

__Using Label (index):__

In [ ]:
# import pandas and numpy 
import pandas as pd
import numpy as np
 
# creating simple array
data = np.array(['M', 'O', 'H', 'D', 'F', 'A', 'I', 'Z', 'Y'])
ser = pd.Series(data,index=[10,11,12,13,14,15,16,17,18])
  
  
# accessing a element using index element
print(ser[14])

F

#### __3. Indexing and Selecting Data in Series__

In [ ]:
# importing pandas module  
import pandas as pd  
     
# making data frame  
df = pd.read_csv("/content/nba.csv")  
   
ser = pd.Series(df['Name']) 
data = ser.head(10)
data

0    Avery Bradley
1      Jae Crowder
2     John Holland
3      R.J. Hunter
4    Jonas Jerebko
5     Amir Johnson
6    Jordan Mickey
7     Kelly Olynyk
8     Terry Rozier
9     Marcus Smart
Name: Name, dtype: object

In [ ]:
# using indexing operator
data[3:6]

3      R.J. Hunter
4    Jonas Jerebko
5     Amir Johnson
Name: Name, dtype: object

__Indexing a Series using `.loc[]`:__

In [ ]:
# using .loc[] function
data.loc[3:6]

3      R.J. Hunter
4    Jonas Jerebko
5     Amir Johnson
6    Jordan Mickey
Name: Name, dtype: object

__Indexing a Series using `.iloc[]`:__

In [ ]:
# using .iloc[] function
data.iloc[3:6]

3      R.J. Hunter
4    Jonas Jerebko
5     Amir Johnson
Name: Name, dtype: object

#### __4. **Binary** Operation on Series__

In [ ]:
# importing pandas module  
import pandas as pd  
 
# creating a series
data = pd.Series([5, 2, 3,7], index=['a', 'b', 'c', 'd'])
 
# creating a series
data1 = pd.Series([1, 6, 4, 9], index=['a', 'b', 'd', 'e'])
 
print(data, "\n\n", data1)

a    5
b    2
c    3
d    7
dtype: int64

 a    1
b    6
d    4
e    9
dtype: int64

In [ ]:
# adding two series using
# .add
data.add(data1, fill_value=0)

a     6.0
b     8.0
c     3.0
d    11.0
e     9.0
dtype: float64

__Code #2:__

In [ ]:
# subtracting two series using
# .sub
data.sub(data1, fill_value=0)

a    4.0
b   -4.0
c    3.0
d    3.0
e   -9.0
dtype: float64

#### __5. Conversion Operation on Series__

In [ ]:
# Python program using astype
# to convert a datatype of series
 
# importing pandas module  
import pandas as pd 
   
# reading csv file from url  
data = pd.read_csv("/content/nba.csv") 
    
# dropping null value columns to avoid errors 
data.dropna(inplace = True) 
   
# storing dtype before converting 
before = data.dtypes 
   
# converting dtypes using astype 
data["Salary"]= data["Salary"].astype(int) 
data["Number"]= data["Number"].astype(str) 
   
# storing dtype after converting 
after = data.dtypes 
   
# printing to compare 
print("BEFORE CONVERSION\n", before, "\n") 
print("AFTER CONVERSION\n", after, "\n")

BEFORE CONVERSION
 Name         object
Team         object
Number      float64
Position     object
Age         float64
Height       object
Weight      float64
College      object
Salary      float64
dtype: object

AFTER CONVERSION
 Name         object
Team         object
Number       object
Position     object
Age         float64
Height       object
Weight      float64
College      object
Salary        int64
dtype: object

In [ ]:
# Python program converting
# a series into list
 
# importing pandas module  
import pandas as pd  
   
# importing regex module 
import re 
     
# making data frame  
data = pd.read_csv("/content/nba.csv")  
     
# removing null values to avoid errors  
data.dropna(inplace = True)  
   
# storing dtype before operation 
dtype_before = type(data["Salary"]) 
   
# converting to list 
salary_list = data["Salary"].tolist() 
   
# storing dtype after operation 
dtype_after = type(salary_list) 
   
# printing dtype 
print("Data type before converting = {}\nData type after converting = {}"
      .format(dtype_before, dtype_after)) 
   
# displaying list 
salary_list

Data type before converting = <class 'pandas.core.series.Series'>
Data type after converting = <class 'list'>

[7730337.0,
 6796117.0,
 1148640.0,
 1170960.0,
 2165160.0,
 1824360.0,
 3431040.0,
 2569260.0,
 6912869.0,
 3425510.0,
 1749840.0,
 2616975.0,
 845059.0,
 1500000.0,
 1335480.0,
 6300000.0,
 134215.0,
 1500000.0,
 19689000.0,
 1140240.0,
 947276.0,
 981348.0,
 947276.0,
 947276.0,
 11235955.0,
 8000000.0,
 1635476.0,
 22875000.0,
 845059.0,
 845059.0,
 1572360.0,
 12650000.0,
 3750000.0,
 1636842.0,
 4000000.0,
 167406.0,
 947276.0,
 1000000.0,
 4626960.0,
 845059.0,
 1074169.0,
 6500000.0,
 2144772.0,
 525093.0,
 3457800.0,
 4582680.0,
 947276.0,
 2869440.0,
 947276.0,
 525093.0,
 13600000.0,
 10050000.0,
 2500000.0,
 7000000.0,
 12000000.0,
 6268675.0,
 650000.0,
 3553917.0,
 245177.0,
 1509360.0,
 3873398.0,
 13800000.0,
 947276.0,
 11370786.0,
 2008748.0,
 14260870.0,
 11710456.0,
 1131960.0,
 845059.0,
 1270964.0,
 3815000.0,
 15501000.0,
 1100602.0,
 111444.0,
 5675000.0,
 525093.0,
 9650000.0,
 18907726.0,
 1100602.0,
 19689000.0,
 947276.0,
 21468695.0,
 3376000.0,
 7085000.0,
 3110796.0,
 1159680.0,
 3000000.0,
 845059.0,
 700000.0,
 845059.0,
 15592217.0,
 1724250.0,
 1155600.0,
 3132240.0,
 5103120.0,
 981348.0,
 947276.0,
 5219169.0,
 13500000.0,
 2127840.0,
 206192.0,
 1160160.0,
 981348.0,
 13500000.0,
 3807120.0,
 1035000.0,
 55722.0,
 947276.0,
 5500000.0,
 2041080.0,
 83397.0,
 981348.0,
 1015421.0,
 1449187.0,
 3398280.0,
 5013559.0,
 15851950.0,
 947276.0,
 525093.0,
 12403101.0,
 7700000.0,
 3156600.0,
 845059.0,
 9500000.0,
 845059.0,
 2250000.0,
 16407500.0,
 4500000.0,
 8500000.0,
 947276.0,
 2380440.0,
 1015421.0,
 13400000.0,
 1391160.0,
 20093064.0,
 1535880.0,
 1147276.0,
 8193029.0,
 16407501.0,
 947276.0,
 947276.0,
 1276000.0,
 19689000.0,
 111196.0,
 8988765.0,
 14260870.0,
 2100000.0,
 2500000.0,
 6500000.0,
 2170465.0,
 111444.0,
 1252440.0,
 2891760.0,
 845059.0,
 3272091.0,
 16000000.0,
 600000.0,
 13913044.0,
 2841960.0,
 6270000.0,
 5000000.0,
 3000000.0,
 4050000.0,
 1007026.0,
 17120106.0,
 8000000.0,
 4000000.0,
 1358880.0,
 211744.0,
 1100000.0,
 7000000.0,
 2357760.0,
 845059.0,
 1007026.0,
 3000000.0,
 2399040.0,
 947276.0,
 1662360.0,
 2943221.0,
 8000000.0,
 14700000.0,
 16407500.0,
 295327.0,
 845059.0,
 5152440.0,
 2109294.0,
 6600000.0,
 1733040.0,
 1449000.0,
 4290000.0,
 1100602.0,
 3950313.0,
 4053446.0,
 2085671.0,
 16407500.0,
 1270964.0,
 15361500.0,
 845059.0,
 947276.0,
 5378974.0,
 8193030.0,
 306527.0,
 6486486.0,
 8229375.0,
 1646400.0,
 200600.0,
 15756438.0,
 1000000.0,
 2489530.0,
 3189794.0,
 947276.0,
 1404600.0,
 5158539.0,
 5000000.0,
 3542500.0,
 4088019.0,
 9588426.0,
 700902.0,
 845059.0,
 1201440.0,
 1230840.0,
 9638555.0,
 9000000.0,
 5464000.0,
 8500000.0,
 1100602.0,
 3036927.0,
 2850000.0,
 7070730.0,
 169883.0,
 1164858.0,
 845059.0,
 10734586.0,
 845059.0,
 1320000.0,
 15514031.0,
 1015421.0,
 10595507.0,
 55722.0,
 3382023.0,
 19689000.0,
 1142880.0,
 947276.0,
 5250000.0,
 10000000.0,
 16407500.0,
 200600.0,
 250750.0,
 3578947.0,
 525093.0,
 1499187.0,
 2000000.0,
 1304520.0,
 2854940.0,
 12000000.0,
 1000000.0,
 5746479.0,
 18671659.0,
 947276.0,
 525093.0,
 3333333.0,
 8000000.0,
 947276.0,
 189455.0,
 947276.0,
 525093.0,
 6110034.0,
 2612520.0,
 6331404.0,
 3034356.0,
 5675000.0,
 2139000.0,
 12000000.0,
 7000000.0,
 4204200.0,
 22192730.0,
 10151612.0,
 2854940.0,
 261894.0,
 845059.0,
 5543725.0,
 525093.0,
 20000000.0,
 981348.0,
 2481720.0,
 947276.0,
 4171680.0,
 845059.0,
 1294440.0,
 2380593.0,
 5192520.0,
 2505720.0,
 4300000.0,
 11250000.0,
 5000000.0,
 4000000.0,
 5694674.0,
 4375000.0,
 561716.0,
 3300000.0,
 273038.0,
 8000000.0,
 1920240.0,
 4662960.0,
 2170465.0,
 1100602.0,
 200600.0,
 15851950.0,
 2814000.0,
 3000000.0,
 3533333.0,
 10449438.0,
 11235955.0,
 1584480.0,
 947276.0,
 4345000.0,
 258489.0,
 1474440.0,
 1282080.0,
 2148360.0,
 2056920.0,
 1938840.0,
 947276.0,
 5703600.0,
 5758680.0,
 2279040.0,
 3750000.0,
 20158622.0,
 3135000.0,
 1140240.0,
 16407500.0,
 1463040.0,
 222888.0,
 3344000.0,
 2021520.0,
 1210800.0,
 4500000.0,
 5138430.0,
 16744218.0,
 525093.0,
 8042895.0,
 625093.0,
 947276.0,
 6980802.0,
 2894059.0,
 6000000.0,
 5016000.0,
 3075880.0,
 4236287.0,
 2525160.0,
 525093.0,
 1415520.0,
 2854940.0,
 2637720.0,
 4775000.0,
 2658240.0,
 9463484.0,
 12000000.0,
 15409570.0,
 1348440.0,
 981348.0,
 2239800.0,
 2433333.0,
 947276.0]

![alt text](https://scontent.fdel32-1.fna.fbcdn.net/v/t1.0-9/117176762_2992912790935596_3836520851615567592_o.jpg?_nc_cat=106&_nc_sid=0debeb&_nc_ohc=wU6EVSp7xxQAX_BugPZ&_nc_ht=scontent.fdel32-1.fna&oh=0e04c2c11bf28ad99af25f0a5693d079&oe=5F55DEE7)

## __3. Viewing Data__

#### __`.head( )` method__

In [ ]:
data.head(5)

            Name            Team  Number  ... Weight            College     Salary
0  Avery Bradley  Boston Celtics     0.0  ...  180.0              Texas  7730337.0
1    Jae Crowder  Boston Celtics    99.0  ...  235.0          Marquette  6796117.0
2   John Holland  Boston Celtics    30.0  ...  205.0  Boston University        NaN
3    R.J. Hunter  Boston Celtics    28.0  ...  185.0      Georgia State  1148640.0
4  Jonas Jerebko  Boston Celtics     8.0  ...  231.0                NaN  5000000.0

[5 rows x 9 columns]

In [ ]:
 data["Name"].head(5) # Series

0    Avery Bradley
1      Jae Crowder
2     John Holland
3      R.J. Hunter
4    Jonas Jerebko
Name: Name, dtype: object

#### __`.tail( )` method__

In [ ]:
data.tail(5)

             Name       Team  Number Position  ...  Height Weight  College     Salary
453  Shelvin Mack  Utah Jazz     8.0       PG  ...     6-3  203.0   Butler  2433333.0
454     Raul Neto  Utah Jazz    25.0       PG  ...     6-1  179.0      NaN   900000.0
455  Tibor Pleiss  Utah Jazz    21.0        C  ...     7-3  256.0      NaN  2900000.0
456   Jeff Withey  Utah Jazz    24.0        C  ...     7-0  231.0   Kansas   947276.0
457           NaN        NaN     NaN      NaN  ...     NaN    NaN      NaN        NaN

[5 rows x 9 columns]

#### __`.describe( )` method__

In [ ]:
# importing pandas module 
import pandas as pd 

# importing regex module 
import re 
	
# making data frame 
data = pd.read_csv('/content/nba.csv') 
	
# removing null values to avoid errors 
data.dropna(inplace = True) 

# percentile list 
perc =[.20, .40, .60, .80] 

# list of dtypes to include 
include =['object', 'float', 'int'] 

# calling describe method 
desc = data.describe(percentiles = perc, include = include) 

# display 
desc

               Name                  Team  ...   College        Salary
count           364                   364  ...       364  3.640000e+02
unique          364                    30  ...       115           NaN
top     Rodney Hood  New Orleans Pelicans  ...  Kentucky           NaN
freq              1                    16  ...        22           NaN
mean            NaN                   NaN  ...       NaN  4.620311e+06
std             NaN                   NaN  ...       NaN  5.119716e+06
min             NaN                   NaN  ...       NaN  5.572200e+04
20%             NaN                   NaN  ...       NaN  9.472760e+05
40%             NaN                   NaN  ...       NaN  1.638754e+06
50%             NaN                   NaN  ...       NaN  2.515440e+06
60%             NaN                   NaN  ...       NaN  3.429934e+06
80%             NaN                   NaN  ...       NaN  7.838202e+06
max             NaN                   NaN  ...       NaN  2.287500e+07

[13 rows x 9 columns]

In [ ]:
# importing pandas module 
import pandas as pd 

# importing regex module 
import re 
	
# making data frame 
data = pd.read_csv('/content/nba.csv') 
	
# removing null values to avoid errors 
data.dropna(inplace = True) 

# calling describe method 
desc = data["Name"].describe() 

# display 
desc

count             364
unique            364
top       Rodney Hood
freq                1
Name: Name, dtype: object

#### __`dataframe.to_numpy`__

In [ ]:
# importing pandas 
import pandas as pd  
   
# reading the csv   
data = pd.read_csv('/content/nba.csv')  
      
data.dropna(inplace = True) 
   
# creating DataFrame form weight column 
df = pd.DataFrame(data['Weight'].head()) 
   
# using to_numpy() function 
df.to_numpy()

array([[180.],
       [235.],
       [185.],
       [235.],
       [238.]])

In [ ]:
# providing dtype 
df.to_numpy(dtype ='float32')

array([[180.],
       [235.],
       [185.],
       [235.],
       [238.]], dtype=float32)

In [ ]:
type(df.to_numpy())

numpy.ndarray

#### __`Series.to_numpy( )`__

In [ ]:
# creating series form weight column  
df = pd.Series(data['Weight'].head()) 
  
# using to_numpy() function 
df.to_numpy()

array([180., 235., 185., 235., 238.])

In [ ]:
# creating series form weight column  
df = pd.Series(data['Weight'].head()) 
  
# using to_numpy() function 
df.to_numpy(dtype ='float32')

array([180., 235., 185., 235., 238.], dtype=float32)

#### __`Series.as_matrix( )`__ _Deprecated_

$\color{red}{\text{NOTE}}$

The purpose of `.as_matrix` method is to Convert the frame to its __Numpy-array__ representation.

`as_matrix` method is deprecated __since `0.23.0`__


`0.25.1` documentation says : Deprecated since version `0.23.0`: Use DataFrame.values() instead

The two alternatives are

- `.values()` : Returns numpy.ndarray

- `.to_numpy()` : Returns numpy.ndarray

__The error TypeError__ `'numpy.ndarray' object is not callable` means that you tried to call a numpy array as a function.

In [ ]:
# importing pandas as pd 
import pandas as pd 
  
# Creating the Series 
sr = pd.Series(['New York', 'Chicago', 'Toronto', 'Lisbon', 'Rio']) 
  
# Create the Index 
index_ = ['City 1', 'City 2', 'City 3', 'City 4', 'City 5']  
  
# set the index 
sr.index = index_ 
  
# Print the series 
print(sr)

City 1    New York
City 2     Chicago
City 3     Toronto
City 4      Lisbon
City 5         Rio
dtype: object

#### __`DataFrame.values`__

`DataFrame.values` attribute return a Numpy representation of the given DataFrame.

In [ ]:
# importing pandas as pd 
import pandas as pd 

# Creating the DataFrame 
df = pd.DataFrame({'Weight':[45, 88, 56, 15, 71], 
				'Name':['Sam', 'Andrea', 'Alex', 'Robin', 'Kia'], 
				'Age':[14, 25, 55, 8, 21]}) 

# Print the DataFrame 
df.head()

   Weight    Name  Age
0      45     Sam   14
1      88  Andrea   25
2      56    Alex   55
3      15   Robin    8
4      71     Kia   21

In [ ]:
# return the numpy representation of this dataframe 
df.values

array([[45, 'Sam', 14],
       [88, 'Andrea', 25],
       [56, 'Alex', 55],
       [15, 'Robin', 8],
       [71, 'Kia', 21]], dtype=object)

In [ ]:
# importing pandas as pd 
import pandas as pd 

# Creating the DataFrame 
df = pd.DataFrame({"A":[12, 4, 5, None, 1], 
				"B":[7, 2, 54, 3, None], 
				"C":[20, 16, 11, 3, 8], 
				"D":[14, 3, None, 2, 6]}) 

# Print the DataFrame 
df.head()

      A     B   C     D
0  12.0   7.0  20  14.0
1   4.0   2.0  16   3.0
2   5.0  54.0  11   NaN
3   NaN   3.0   3   2.0
4   1.0   NaN   8   6.0

In [ ]:
df.values

array([[12.,  7., 20., 14.],
       [ 4.,  2., 16.,  3.],
       [ 5., 54., 11., nan],
       [nan,  3.,  3.,  2.],
       [ 1., nan,  8.,  6.]])

## __4. Selection__

### __4.1 Dealing with Columns:__

#### __a. Column Selection:__

In [ ]:
# Import pandas package 
import pandas as pd 
  
# Define a dictionary containing employee data 
data = {'Name':['Jai', 'Princi', 'Gaurav', 'Anuj'], 
        'Age':[27, 24, 22, 32], 
        'Address':['Delhi', 'Kanpur', 'Allahabad', 'Kannauj'], 
        'Qualification':['Msc', 'MA', 'MCA', 'Phd']} 
  
# Convert the dictionary into DataFrame  
df = pd.DataFrame(data) 
  
# select two columns 
print(df[['Name', 'Qualification']])

     Name Qualification
0     Jai           Msc
1  Princi            MA
2  Gaurav           MCA
3    Anuj           Phd

#### __b. Column Addition:__

In [ ]:
# Import pandas package  
import pandas as pd 
  
# Define a dictionary containing Students data 
data = {'Name': ['Jai', 'Princi', 'Gaurav', 'Anuj'], 
        'Height': [5.1, 6.2, 5.1, 5.2], 
        'Qualification': ['Msc', 'MA', 'Msc', 'Msc']} 
  
# Convert the dictionary into DataFrame 
df = pd.DataFrame(data) 
  
# Declare a list that is to be converted into a column 
address = ['Delhi', 'Bangalore', 'Chennai', 'Patna'] 
  
# Using 'Address' as the column name 
# and equating it to the list 
df['Address'] = address 
  
# Observe the result 
print(df)

     Name  Height Qualification    Address
0     Jai     5.1           Msc      Delhi
1  Princi     6.2            MA  Bangalore
2  Gaurav     5.1           Msc    Chennai
3    Anuj     5.2           Msc      Patna

#### __c. Column Deletion:__

In [ ]:
# importing pandas module 
import pandas as pd 
  
# making data frame from csv file 
data = pd.read_csv("nba.csv", index_col ="Name" ) 
  
data.columns

Index(['Team', 'Number', 'Position', 'Age', 'Height', 'Weight', 'College',
       'Salary'],
      dtype='object')

In [ ]:
# dropping passed columns 
data.drop(["Team", "Weight"], axis = 1, inplace = True) 
  
data.columns

Index(['Number', 'Position', 'Age', 'Height', 'College', 'Salary'], dtype='object')

### __4.2 Dealing with Rows:__

#### __a. Row Selection:__

In [ ]:
# importing pandas package 
import pandas as pd 
  
# making data frame from csv file 
data = pd.read_csv("nba.csv", index_col ="Name") 
  
# retrieving row by loc method 
first = data.loc["Avery Bradley"] 
second = data.loc["R.J. Hunter"] 
  
  
print(first, "\n\n\n", second)

Team        Boston Celtics
Number                   0
Position                PG
Age                     25
Height                 6-2
Weight                 180
College              Texas
Salary         7.73034e+06
Name: Avery Bradley, dtype: object


 Team        Boston Celtics
Number                  28
Position                SG
Age                     22
Height                 6-5
Weight                 185
College      Georgia State
Salary         1.14864e+06
Name: R.J. Hunter, dtype: object

#### __b. Row Addition:__

In [ ]:
# importing pandas module  
import pandas as pd  
    
# making data frame  
df = pd.read_csv("nba.csv", index_col ="Name")  
  
df.head(10) 
  
new_row = pd.DataFrame({'Name':'jhon', 'Team':'Boston', 'Number':3, 
                        'Position':'PG', 'Age':33, 'Height':'6-2', 
                        'Weight':189, 'College':'MIT', 'Salary':99999}, 
                                                            index =[0]) 
# simply concatenate both dataframes 
df = pd.concat([new_row, df]).reset_index(drop = True) 
df.head(-5)

     Name            Team  Number  ... Weight            College      Salary
0    jhon          Boston     3.0  ...  189.0                MIT     99999.0
1     NaN  Boston Celtics     0.0  ...  180.0              Texas   7730337.0
2     NaN  Boston Celtics    99.0  ...  235.0          Marquette   6796117.0
3     NaN  Boston Celtics    30.0  ...  205.0  Boston University         NaN
4     NaN  Boston Celtics    28.0  ...  185.0      Georgia State   1148640.0
..    ...             ...     ...  ...    ...                ...         ...
449   NaN       Utah Jazz    20.0  ...  226.0             Butler  15409570.0
450   NaN       Utah Jazz     5.0  ...  206.0               Duke   1348440.0
451   NaN       Utah Jazz     2.0  ...  226.0                NaN   2050000.0
452   NaN       Utah Jazz    23.0  ...  206.0             Dayton    981348.0
453   NaN       Utah Jazz    41.0  ...  234.0           Kentucky   2239800.0

[454 rows x 9 columns]

#### __c. Row Deletion:__

In [ ]:
# importing pandas module 
import pandas as pd 
  
# making data frame from csv file 
data = pd.read_csv("nba.csv", index_col ="Name" ) 
  
# dropping passed values 
data.drop(["Avery Bradley", "John Holland", "R.J. Hunter", 
                            "R.J. Hunter"], inplace = True) 
  
# display 
data

                         Team  Number Position  ...  Weight    College      Salary
Name                                            ...
Jae Crowder    Boston Celtics    99.0       SF  ...   235.0  Marquette   6796117.0
Jonas Jerebko  Boston Celtics     8.0       PF  ...   231.0        NaN   5000000.0
Amir Johnson   Boston Celtics    90.0       PF  ...   240.0        NaN  12000000.0
Jordan Mickey  Boston Celtics    55.0       PF  ...   235.0        LSU   1170960.0
Kelly Olynyk   Boston Celtics    41.0        C  ...   238.0    Gonzaga   2165160.0
...                       ...     ...      ...  ...     ...        ...         ...
Shelvin Mack        Utah Jazz     8.0       PG  ...   203.0     Butler   2433333.0
Raul Neto           Utah Jazz    25.0       PG  ...   179.0        NaN    900000.0
Tibor Pleiss        Utah Jazz    21.0        C  ...   256.0        NaN   2900000.0
Jeff Withey         Utah Jazz    24.0        C  ...   231.0     Kansas    947276.0
NaN                       NaN     NaN      NaN  ...     NaN        NaN         NaN

[455 rows x 8 columns]

### __4.3 Extracting rows using `.loc[]`__

#### __a. Extracting single Row__

In [ ]:
# importing pandas package 
import pandas as pd 
  
# making data frame from csv file 
data = pd.read_csv("nba.csv", index_col ="Name") 
  
# retrieving row by loc method 
first = data.loc["Avery Bradley"] 
second = data.loc["R.J. Hunter"] 
  
  
print(first, "\n\n\n", second)

Team        Boston Celtics
Number                   0
Position                PG
Age                     25
Height                 6-2
Weight                 180
College              Texas
Salary         7.73034e+06
Name: Avery Bradley, dtype: object


 Team        Boston Celtics
Number                  28
Position                SG
Age                     22
Height                 6-5
Weight                 185
College      Georgia State
Salary         1.14864e+06
Name: R.J. Hunter, dtype: object

#### __b. Multiple parameters__

In [ ]:
# importing pandas package 
import pandas as pd 
  
# making data frame from csv file 
data = pd.read_csv("nba.csv", index_col ="Name") 
  
# retrieving rows by loc method 
rows = data.loc[["Avery Bradley", "R.J. Hunter"]] 
  
# checking data type of rows 
print(type(rows)) 
  
# display 
rows

<class 'pandas.core.frame.DataFrame'>

                         Team  Number  ...        College     Salary
Name                                   ...
Avery Bradley  Boston Celtics     0.0  ...          Texas  7730337.0
R.J. Hunter    Boston Celtics    28.0  ...  Georgia State  1148640.0

[2 rows x 8 columns]

#### __c. multiple rows with same index__

In [ ]:
# importing pandas package 
import pandas as pd 
  
# making data frame from csv file 
data = pd.read_csv("nba.csv", index_col ="Team") 
  
# retrieving rows by loc method 
rows = data.loc["Utah Jazz"] 
  
# checking data type of rows 
print(type(rows)) 
  
# display 
rows

<class 'pandas.core.frame.DataFrame'>

                     Name  Number Position  ...  Weight       College      Salary
Team                                        ...
Utah Jazz   Trevor Booker    33.0       PF  ...   228.0       Clemson   4775000.0
Utah Jazz      Trey Burke     3.0       PG  ...   191.0      Michigan   2658240.0
Utah Jazz      Alec Burks    10.0       SG  ...   214.0      Colorado   9463484.0
Utah Jazz      Dante Exum    11.0       PG  ...   190.0           NaN   3777720.0
Utah Jazz  Derrick Favors    15.0       PF  ...   265.0  Georgia Tech  12000000.0
Utah Jazz     Rudy Gobert    27.0        C  ...   245.0           NaN   1175880.0
Utah Jazz  Gordon Hayward    20.0       SF  ...   226.0        Butler  15409570.0
Utah Jazz     Rodney Hood     5.0       SG  ...   206.0          Duke   1348440.0
Utah Jazz      Joe Ingles     2.0       SF  ...   226.0           NaN   2050000.0
Utah Jazz   Chris Johnson    23.0       SF  ...   206.0        Dayton    981348.0
Utah Jazz      Trey Lyles    41.0       PF  ...   234.0      Kentucky   2239800.0
Utah Jazz    Shelvin Mack     8.0       PG  ...   203.0        Butler   2433333.0
Utah Jazz       Raul Neto    25.0       PG  ...   179.0           NaN    900000.0
Utah Jazz    Tibor Pleiss    21.0        C  ...   256.0           NaN   2900000.0
Utah Jazz     Jeff Withey    24.0        C  ...   231.0        Kansas    947276.0

[15 rows x 8 columns]

#### __d. rows between two index labels__

In [ ]:
# importing pandas package 
import pandas as pd 
  
# making data frame from csv file 
data = pd.read_csv("nba.csv", index_col ="Name") 
  
# retrieving rows by loc method 
rows = data.loc["Avery Bradley":"Isaiah Thomas"] 
  
# checking data type of rows 
print(type(rows)) 
  
# display 
rows

<class 'pandas.core.frame.DataFrame'>

                           Team  Number  ...            College      Salary
Name                                     ...
Avery Bradley    Boston Celtics     0.0  ...              Texas   7730337.0
Jae Crowder      Boston Celtics    99.0  ...          Marquette   6796117.0
John Holland     Boston Celtics    30.0  ...  Boston University         NaN
R.J. Hunter      Boston Celtics    28.0  ...      Georgia State   1148640.0
Jonas Jerebko    Boston Celtics     8.0  ...                NaN   5000000.0
Amir Johnson     Boston Celtics    90.0  ...                NaN  12000000.0
Jordan Mickey    Boston Celtics    55.0  ...                LSU   1170960.0
Kelly Olynyk     Boston Celtics    41.0  ...            Gonzaga   2165160.0
Terry Rozier     Boston Celtics    12.0  ...         Louisville   1824360.0
Marcus Smart     Boston Celtics    36.0  ...     Oklahoma State   3431040.0
Jared Sullinger  Boston Celtics     7.0  ...         Ohio State   2569260.0
Isaiah Thomas    Boston Celtics     4.0  ...         Washington   6912869.0

[12 rows x 8 columns]

### __4.4 Extracting rows using `.iloc[]`__

#### __a. Extracting single row and comparing with `.loc[]`__

In [ ]:
# importing pandas package 
import pandas as pd 
  
# making data frame from csv file  
data = pd.read_csv("nba.csv") 
  
# retrieving rows by loc method  
row1 = data.loc[3] 
  
# retrieving rows by iloc method 
row2 = data.iloc[3] 
  
# checking if values are equal 
row1 == row2

Name        True
Team        True
Number      True
Position    True
Age         True
Height      True
Weight      True
College     True
Salary      True
Name: 3, dtype: bool

#### __b. Extracting multiple rows with index__

In [ ]:
# importing pandas package 
import pandas as pd 
  
# making data frame from csv file  
data = pd.read_csv("nba.csv") 
  
# retrieving rows by loc method  
row1 = data.iloc[[4, 5, 6, 7]] 
  
# retrieving rows by loc method  
row2 = data.iloc[4:8] 
  
# comparing values 
row1 == row2

   Name  Team  Number  Position   Age  Height  Weight  College  Salary
4  True  True    True      True  True    True    True    False    True
5  True  True    True      True  True    True    True    False    True
6  True  True    True      True  True    True    True     True    True
7  True  True    True      True  True    True    True     True    True

### __4.5 Indexing and Selecting Data with Pandas__

In [ ]:
import pandas as pd 
  
# making data frame from csv file 
data = pd.read_csv("nba.csv", index_col ="Name") 
  
  
# retrieving rows by iloc method  
row2 = data.iloc[3] 

row2

Team        Boston Celtics
Number                  28
Position                SG
Age                     22
Height                 6-5
Weight                 185
College      Georgia State
Salary         1.14864e+06
Name: R.J. Hunter, dtype: object

In [ ]:
import pandas as pd 
  
# making data frame from csv file 
data = pd.read_csv("nba.csv", index_col ="Name") 
  
  
# retrieving multiple rows by iloc method  
row2 = data.iloc [[3, 5, 7]] 

# Display
row2

                        Team  Number  ...        College      Salary
Name                                  ...
R.J. Hunter   Boston Celtics    28.0  ...  Georgia State   1148640.0
Amir Johnson  Boston Celtics    90.0  ...            NaN  12000000.0
Kelly Olynyk  Boston Celtics    41.0  ...        Gonzaga   2165160.0

[3 rows x 8 columns]

In [ ]:
import pandas as pd 
  
# making data frame from csv file 
data = pd.read_csv("nba.csv", index_col ="Name") 
  
# retrieving two rows and two columns by iloc method  
row2 = data.iloc [[3, 4], [1, 2]] 
  
print(row2)

               Number Position
Name
R.J. Hunter      28.0       SG
Jonas Jerebko     8.0       PF

In [ ]:
import pandas as pd 
  
# making data frame from csv file 
data = pd.read_csv("nba.csv", index_col ="Name") 
    
# retrieving all rows and some columns by iloc method  
row2 = data.iloc [:, [1, 2]] 
    
print(row2)

               Number Position
Name
Avery Bradley     0.0       PG
Jae Crowder      99.0       SF
John Holland     30.0       SG
R.J. Hunter      28.0       SG
Jonas Jerebko     8.0       PF
...               ...      ...
Shelvin Mack      8.0       PG
Raul Neto        25.0       PG
Tibor Pleiss     21.0        C
Jeff Withey      24.0        C
NaN               NaN      NaN

[458 rows x 2 columns]

![3_Pandas](https://scontent.fdel32-1.fna.fbcdn.net/v/t1.0-9/117726099_2996142360612639_1118972370572821058_n.jpg?_nc_cat=108&_nc_sid=730e14&_nc_ohc=zJr7vBJdbLMAX886dTx&_nc_ht=scontent.fdel32-1.fna&oh=254817a243dec176341d66ebb3c6a486&oe=5F5B1434)

### __4.6 Boolean Indexing in Pandas__

In [ ]:
# importing pandas as pd 
import pandas as pd 
   
# dictionary of lists 
dict = {'name':["aparna", "pankaj", "sudhir", "Geeku"], 
        'degree': ["MBA", "BCA", "M.Tech", "MBA"], 
        'score':[90, 40, 80, 98]} 
   
df = pd.DataFrame(dict, index = [True, False, True, False]) 
   
print(df)

         name  degree  score
True   aparna     MBA     90
False  pankaj     BCA     40
True   sudhir  M.Tech     80
False   Geeku     MBA     98

In [ ]:
# accessing a dataframe using .loc[] function  
print(df.loc[True])

        name  degree  score
True  aparna     MBA     90
True  sudhir  M.Tech     80

In [ ]:
# accessing a dataframe using .iloc[] function  
print(df.iloc[True]) # TypeError

In [ ]:
# accessing a dataframe using .iloc[] function 
print(df.iloc[1])

name      pankaj
degree       BCA
score         40
dtype: object

In [ ]:
# Applying a boolean mask to a dataframe :
df = pd.DataFrame(dict, index = [0, 1, 2, 3]) 

print(df[[True, False, True, False]])

     name  degree  score
0  aparna     MBA     90
2  sudhir  M.Tech     80

In [ ]:
#Masking data based on column value :
df = pd.DataFrame(dict) 
   
# using a comparison operator for filtering of data 
print(df['degree'] == 'BCA')

0    False
1     True
2    False
3    False
Name: degree, dtype: bool

In [ ]:
# Masking data based on index value :
df = pd.DataFrame(dict, index = [0, 1, 2, 3]) 
  
mask = df.index == 0
  
print(df[mask])

     name degree  score
0  aparna    MBA     90

In [ ]:
# importing pandas package 
import pandas as pd 
   
# making data frame from csv file 
data = pd.read_csv("nba.csv", index_col ="Name") 
   
# using greater than operator for filtering of data 
print(data['Age'] > 25)

Name
Avery Bradley    False
Jae Crowder      False
John Holland      True
R.J. Hunter      False
Jonas Jerebko     True
                 ...
Shelvin Mack      True
Raul Neto        False
Tibor Pleiss      True
Jeff Withey       True
NaN              False
Name: Age, Length: 458, dtype: bool

### __4.7 `DataFrame.ix[ ]`__

$\color{red}{\text{Note:}}$ __new version of Pandas use `.loc` instead of `.ix`__